app/controllers/articles_controller.rb

  def index
    @articles = Article.page(params[:page]).per(5)
    @tags = Tag.order("created_at DESC")
---
SELECT "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
SELECT "tags".* FROM "tags" ORDER BY created_at DESC

  def new
    @article = Article.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @article = Article.new(params[:article])
    @article.userInfo_id = current_user.id
    @article.save
---
INSERT INTO "articles" ("body", "created_at", "part_id", "title", "updated_at", "userInfo_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "wewewewewe"], ["created_at", Mon, 24 Sep 2012 15:36:43 UTC +00:00], ["part_id", nil], ["title", "wwwwewe"], ["updated_at", Mon, 24 Sep 2012 15:36:43 UTC +00:00], ["userInfo_id", 2]]

  def update
    @article.update_attributes(params[:article])
---
UPDATE "articles" SET "title" = 'ActionController', "body" = 'HTTP通訊協定是一種Request-Response(請求-回應)的流程，客戶端(通常是瀏覽器)向伺服器送出一個HTTP request封包，然後伺服器就回應一個response封包。在上一章中，我們介紹了Rails如何使用路由來分派request到Controller的其中一個Action。而每個Action的任務就是根據客戶端傳來的資料與Model互動，然後回應結果給客戶端。這一章中我們將仔細介紹負責回應請求的Controller。

  def find_article
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]