app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at", "userInfo_id") VALUES (?, ?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", nil], ["body", "wwww"], ["created_at", Wed, 29 Aug 2012 12:10:51 UTC +00:00], ["updated_at", Wed, 29 Aug 2012 12:10:51 UTC +00:00], ["userInfo_id", nil]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(params[:comment])