app/controllers/parts_controller.rb

  def index
    @parts = Part.page(params[:page]).per(5)
---
SELECT "parts".* FROM "parts" LIMIT 5 OFFSET 0

  def create
    @part = Part.new(params[:part])
    @part.save
---
INSERT INTO "parts" ("created_at", "desc", "name", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 27 Sep 2012 15:50:30 UTC +00:00], ["desc", "时事政治"], ["name", "时事"], ["state", 1], ["updated_at", Thu, 27 Sep 2012 15:50:30 UTC +00:00]]

  def update
    @part.update_attributes(params[:part])
---
UPDATE "parts" SET "name" = 'rails ', "desc" = 'rails 技术相关 ', "state" = 1, "updated_at" = '2013-05-12 05:43:17.688362' WHERE "parts"."id" = 1

  def destroy
    @part.destroy
---
DELETE FROM "parts" WHERE "parts"."id" = ?  [["id", 2]]

  def find_part
    @part = Part.find(params[:id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT 1  [["id", "2"]]