app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles" LIMIT 5 OFFSET 0
---
  def index
    @roles = Role.page(params[:page]).per(5)

INSERT INTO "roles" ("created_at", "role_desc", "role_name", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 26 Sep 2012 14:43:18 UTC +00:00], ["role_desc", "测色用户组"], ["role_name", "测色用户组"], ["state", 1], ["updated_at", Wed, 26 Sep 2012 14:43:18 UTC +00:00]]
---
  def create
    @role = Role.new(params[:role])
    @role.save

UPDATE "roles" SET "role_desc" = '系统管理组h6hh6', "state" = 1, "updated_at" = '2012-09-27 07:42:52.384558' WHERE "roles"."id" = 2
---
  def update
    @role.update_attributes(params[:role])

DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 1]]
---
  def destroy
    @role.destroy

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "2"]]
---
  def find_role
    @role = Role.find(params[:id])