app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 5 OFFSET 0
---
  def index
    @users = User.page(params[:page]).per(5)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
  def find_user
    @user = User.find(params[:id])